# $Id: part06.typescript,v 1.1 2015-02-11 13:15:36-08 - - $
# Author: Kevin Cai (kcai2@ucsc.edu)

Script started on Mon 09 Feb 2015 04:47:31 PM PST
[?1034hbash-4.1$ mk lsit[K[K[Kist2.c
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
+ tee list1.c.log
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ tee list2.c.log
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=malloc.c EXECBIN=malloc
+ cid + malloc.c
+ checksource malloc.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 malloc.c -o malloc -lm
+ tee malloc.c.log
malloc.c: In function â€˜mainâ€™:
malloc.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
malloc.c:12:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
+ set +x
============================================================
bash-4.1$ valgrind list2 food [K[K bar
==12968== Memcheck, a memory error detector
==12968== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==12968== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==12968== Command: list2 foo bar
==12968== 
0x4c2c180->node {word=0xfff000429->[ORBIT_SOCKETDIR=/tmp/orbit-kcai2], link=0x4c2c130}
0x4c2c130->node {word=(nil)->[(null)], link=0x4c2c0e0}
0x4c2c0e0->node {word=0xfff000425->[bar], link=0x4c2c090}
0x4c2c090->node {word=0xfff000421->[foo], link=0x4c2c040}
==12968== Conditional jump or move depends on uninitialised value(s)
==12968==    at 0x400682: main (list2.c:22)
==12968== 
==12968== 
==12968== HEAP SUMMARY:
==12968==     in use at exit: 80 bytes in 5 blocks
==12968==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==12968== 
==12968== LEAK SUMMARY:
==12968==    definitely lost: 16 bytes in 1 blocks
==12968==    indirectly lost: 64 bytes in 4 blocks
==12968==      possibly lost: 0 bytes in 0 blocks
==12968==    still reachable: 0 bytes in 0 blocks
==12968==         suppressed: 0 bytes in 0 blocks
==12968== Rerun with --leak-check=full to see details of leaked memory
==12968== 
==12968== For counts of detected and suppressed errors, rerun with: -v
==12968== Use --track-origins=yes to see where uninitialised values come from
==12968== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
bash-4.1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/v/kcai2/private/cmps012m/lab5/list2...done.
(gdb) break 25
Breakpoint 1 at 0x400684: file list2.c, line 25.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/v/kcai2/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601090->node {word=0x7fffffffe499->[MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe495->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe491->[foo], link=0x601010}

Breakpoint 1, main (argc=3, argv=0x7fffffffe0e8) at list2.c:26
26	   return 9;
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) where
#0  main (argc=3, argv=0x7fffffffe0e8) at list2.c:26
(gdb) list
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
$1 = (node *) 0x601090
(gdb) bt
#0  main (argc=3, argv=0x7fffffffe0e8) at list2.c:26
(gdb) print head
$2 = (node *) 0x601090
(gdb) print *head
$3 = {word = 0x7fffffffe499 "MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:", link = 0x601070}
(gdb) print *head[K[K[K[K(head->word)
$4 = 77 'M'
(gdb) print head [K->link-.[K>link->link
$5 = (node *) 0x601030
(gdb) print ([K*(head-.[K>link->link->link)
$6 = {word = 0x7fffffffe491 "foo", link = 0x601010}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 12972] will be killed.

Quit anyway? (y or n) exi   y
bash-4.1$ exit
exit

Script done on Mon 09 Feb 2015 04:50:57 PM PST
