# $Id: part04.typescript,v 1.1 2015-02-11 13:14:25-08 - - $
# Author: Kevin Cai (kcai2@ucsc.edu)

Script started on Mon 09 Feb 2015 04:17:55 PM PST
[?1034hbash-4.1$ valgrind a[Kmalloc
==11012== Memcheck, a memory error detector
==11012== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==11012== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==11012== Command: malloc
==11012== 
0x4c2c090-> {6, (nil)}
==11012== 
==11012== HEAP SUMMARY:
==11012==     in use at exit: 16 bytes in 1 blocks
==11012==   total heap usage: 2 allocs, 1 frees, 32 bytes allocated
==11012== 
==11012== LEAK SUMMARY:
==11012==    definitely lost: 16 bytes in 1 blocks
==11012==    indirectly lost: 0 bytes in 0 blocks
==11012==      possibly lost: 0 bytes in 0 blocks
==11012==    still reachable: 0 bytes in 0 blocks
==11012==         suppressed: 0 bytes in 0 blocks
==11012== Rerun with --leak-check=full to see details of leaked memory
==11012== 
==11012== For counts of detected and suppressed errors, rerun with: -v
==11012== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 6 from 6)
bash-4.1$ gdb malloc
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/v/kcai2/private/cmps012m/lab5/malloc...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file malloc.c, line 13.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/v/kcai2/private/cmps012m/lab5/malloc 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=1, argv=0x7fffffffe0f8) at malloc.c:13
13	   node *ptr = malloc (sizeof (struct node));
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) print ptr
$1 = (node *) 0x0
(gdb) print *ptr
Cannot access memory at address 0x0
(gdb) next
14	   ptr = malloc (sizeof (node));
(gdb) print pr[Ktr
$2 = (node *) 0x601010
(gdb) print *ptr
$3 = {value = 0, link = 0x0}
(gdb) next
15	   ptr->value = 6;
(gdb) next
16	   ptr->link = NULL;
(gdb) next
17	   printf ("%p-> {%d, %p}\n", ptr, ptr->value, ptr->link);
(gdb) print ptr
$4 = (node *) 0x601030
(gdb) print *ptr
$5 = {value = 6, link = 0x0}
(gdb) next next [K[K[K[K[K[K
0x601030-> {6, (nil)}
18	   free (ptr);
(gdb) next
19	   return EXIT_SUCCESS;
(gdb) next
20	}
(gdb) next
0x00000038f021ed5d in __libc_start_main () from /lib64/libc.so.6
(gdb) quit
A debugging session is active.

	Inferior 1 [process 11017] will be killed.

Quit anyway? (y or n) y
bash-4.1$ exit
exit

Script done on Mon 09 Feb 2015 04:18:50 PM PST
