# $Id: part05.typescript,v 1.1 2015-02-11 13:14:59-08 - - $
# Author: Kevin Cai (kcai2@ucsc.edu)

Script started on Mon 09 Feb 2015 04:25:05 PM PST
[?1034hbash-4.1$ mk list1.c
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
+ tee list1.c.log
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=malloc.c EXECBIN=malloc
+ cid + malloc.c
+ checksource malloc.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 malloc.c -o malloc -lm
+ tee malloc.c.log
malloc.c: In function â€˜mainâ€™:
malloc.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
malloc.c:12:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
+ set +x
============================================================
bash-4.1$ ga[K[Kvalag[K[Kgrind ma[K[Klist1
==11436== Memcheck, a memory error detector
==11436== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==11436== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==11436== Command: list1
==11436== 
0x4c2c180->node {word=0xfff00047b->[HOSTNAME=be-linux39.lt.ucsc.edu], link=0x4c2c130}
0x4c2c130->node {word=0xfff00044a->[MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:], link=0x4c2c0e0}
0x4c2c0e0->node {word=0xfff000429->[ORBIT_SOCKETDIR=/tmp/orbit-kcai2], link=0x4c2c090}
0x4c2c090->node {word=(nil)->[(null)], link=0x4c2c040}
==11436== Conditional jump or move depends on uninitialised value(s)
==11436==    at 0x400682: main (list1.c:21)
==11436== 
==11436== 
==11436== HEAP SUMMARY:
==11436==     in use at exit: 80 bytes in 5 blocks
==11436==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==11436== 
==11436== LEAK SUMMARY:
==11436==    definitely lost: 16 bytes in 1 blocks
==11436==    indirectly lost: 64 bytes in 4 blocks
==11436==      possibly lost: 0 bytes in 0 blocks
==11436==    still reachable: 0 bytes in 0 blocks
==11436==         suppressed: 0 bytes in 0 blocks
==11436== Rerun with --leak-check=full to see details of leaked memory
==11436== 
==11436== For counts of detected and suppressed errors, rerun with: -v
==11436== Use --track-origins=yes to see where uninitialised values come from
==11436== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
bash-4.1$ gdb list1
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/v/kcai2/private/cmps012m/lab5/list1...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list1.c, line 14.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/v/kcai2/private/cmps012m/lab5/list1 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=1, argv=0x7fffffffe0f8) at list1.c:14
14	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) print node
Attempt to use a type name as an expression
(gdb) print *node
A syntax error in expression, near `'.
(gdb) next
15	      node *node = malloc (sizeof (struct node));
(gdb) print node
$1 = (node *) 0x0
(gdb) print *node
Cannot access memory at address 0x0
(gdb) next 
16	      assert (node != NULL);
(gdb) next
17	      node->word = argv[argi];
(gdb) next
18	      node->link = head;
(gdb) prit [K[Knt node
$2 = (node *) 0x601010
(gdb) print *node
$3 = {word = 0x7fffffffe45c "/afs/cats.ucsc.edu/users/v/kcai2/private/cmps012m/lab5/list1", 
  link = 0x0}
(gdb) next
19	      head = node;
(gdb) next
14	   for (int argi = 0; argi < 5; ++argi) {
(gdb) next
15	      node *node = malloc (sizeof (struct node));
(gdb) next
16	      assert (node != NULL);
(gdb) quit
A debugging session is active.

	Inferior 1 [process 11463] will be killed.

Quit anyway? (y or n) y
bash-4.1$ exit
exit

Script done on Mon 09 Feb 2015 04:27:07 PM PST
